
'''
Сервер ВС обрабатывает программы двух типов: П1 и П2
Вероятность обработки: П1 - 0.7, П2 - 0.3
Стоимоть обработки: S1 - 5, S2 = 2
Найти выручку за 10 испытаний
а = 47
b = 1
M = 1000
x0 = 1
'''

print('\n')
a = 47
b = 1
M = 1000
x0 = 1
P1 = 0.7 # Probability
P2 = 1
S1 = 0
S2 = 0


for i in range(1,11):
    x0 = (a*x0 + b) % M
    if x0/M < P1:
        print(f'x{i} - Попал в P1 - {x0/M}')
        S1 += 5
    elif x0/M >= P1 and x0/M < P2:
        print(f'x{i} - Попал в P2 - {x0/M}')
        S2 += 2
    else:
        print(f'x{i} - Не попал - {x0/M}')

print(f'\nСтоимость: \nP1 = {S1}\nP2 = {S2}\nОбщая = {S1+S2}')


