# Задача 1
a= 17
b = 1
M = 1000
x= 2

# mod [(a*x + b, M)] - формула линейного кконгруэтного генератора случайных чисел
for i in range(10):
    x = (a*x + 1) % M
    print(x)




# # Задача 2
# # Если поделим каждое число на M = 1000, то получим числа, в диапозоне от 0 до 1
# a= 17
# b = 1
# M = 1000
# x= 1

# for i in range(10):
#     x = ((a*x + 1) % M)
#     print(x / M)
    




# # Задача 3
# # Вероятность отказа 0.3, определить кол-во отказов в последовательности
# a= 17
# b = 1
# M = 1000
# x= 1

# bad = 0
# good = 0
# for i in range(10):
#     x = ((a*x + 1) % M) 
#     if x/1000 <= 0.3 :
#         bad += 1
#     else:
#         good += 1
# print(bad)





# # Задача 4
# a= 17
# b = 1
# M = 1000
# x= 1
# # Вероятность отказа 0.3, определить кол-во отказов в последовательности
# bad = 0
# good = 0
# for i in range(10):
#     x = ((a*x + 1) % M) 
#     if x/1000 <= 0.3 :
#         bad += 1
#     else:
#         good += 1
# print(bad)




# # Задача 5
# # Так и не поняла эту хуйню
# a= 47
# b = 1
# M = 1000
# x= 1

# P1 = 0.5
# P2 = 0.8
# P3 = 1

# # Вероятность отказа 0.3, определить кол-во отказов в последовательности
# count1 = 0
# count2 = 0
# count3 = 0

# for i in range(10):
#     x = ((a*x + 1) % M) 
#     x0 = x/1000
#     print(x0)
#     if 0 <= x0 <= P1:
#         count1+= 1
#     elif P1 < x0 <= P2:
#         count2 += 1
#     elif P2 < x0<= P3:
#         count3 += 1
# print("P1: ", count1, "\nP2: ", count2, "\nP3: ", count3)




# # Задача 6
# # P1 - вероятность = 0.7,  c1 - стоимость Р1, Р2 - вероятность Р1+0.3, с2 - стоимость Р2
# p1 = 0.7
# count1 = 0

# p2 = 0.3
# count2 = 0

# c1 = 5
# c2 = 2

# a= 47
# b = 1
# M = 1000
# x = 1


# for i in range(10):
#     x = ((a*x + 1) % M) 
    
#     x0 = x/1000
#     print(x0)
#     if 0 <= x0 <= p1:
#         count1 += 5
        
#     elif 0.7 < x0:
#         count2 += 2

# print(count1 + count2)        
